export class v34 {
    v3401: string = '';		/*客戶/供應商代號*/
    v3402: string = '';		/*客戶/供應商名稱*/
    v3403: string = '';		/*客戶/供應商簡稱*/
    v3404: number = 0;	    /*1.客戶2.供應商*/
    v3405: number = 0;	    /*客戶(供應商)區分		1.客戶(供應商)2.其他*/
    v3406: string = '';		/*負責人*/
    v3407: string = '';		/*連絡人*/
    v3408: string = '';		/*統一編號*/
    v3409: string = '';		/*地區別代號*/
    v3410: number = 0;		/*信用額度*/
    v3411: string = '';		/*業務員*/
    v3412: string = '';		/*電話*/
    v3413: string = '';		/*傳真*/
    v3414: string = '';		/*B.B.CALL*/
    v3415: string = '';		/*大哥大*/
    v3416: string = '';		/*國別代號*/
    v3417: string = '';		/*幣別代號*/
    v3418: number = 0;	    /*發票否(0.否1.是)*/
    v3419: string = '';		/*客戶/供應商等級*/
    v3420: string = '';		/*公司地址/英文地址1*/
    v3421: string = '';		/*發票地址/英文地址2*/
    v3422: string = '';		/*工廠地址/送貨地址*/
    v3423: string = '';		/*備註*/
    v3424: string = '';		/*客戶/供應商類別*/
    v3425: string = '';		/*電話(1)*/
    v3426: string = '';		/*電話(2)*/
    v3427: number = 0;      /*付款方式	1.月結2.貨到*/
    v3428: number = 0;	    /*帳款天數/票據到期*/
    v3429: number = 0;	    /*通路*/
    v3430: string = '';		/*課稅別1.應稅2.零稅3.免稅*/
    v3431: string = '';		/*發票種類1.三聯電子2.三聯收銀機3.2聯4.免開發票*/
    v3432: number = 0;		/*結帳日*/
    v3433: string = '';     /*匯款銀行*/
    v3434: string = '';     /*匯款帳號*/
    v3435: number;          /*Lat*/
    v3436: number;          /*Lng*/
    v3496: string = '';		/*建立者*/
    v3497: Date; 		    /*建立日期*/
    v3498: string = '';		/*異動者*/
    v3499: Date;		    /*異動日期*/
}